In [1]:
import pandas as pd
import numpy as np

In [2]:
casts = pd.read_csv('cast.csv')

In [3]:
cm = casts.set_index(['title','n']).sort_index()

In [4]:
cm.loc['Macbeth']

      year                 name     type        character
n
4.0   1916  Spottiswoode Aitken    actor           Duncan
6.0   1916           Mary Alden  actress     Lady Macduff
18.0  1948       William Alland    actor  Second Murderer
21.0  1997         Stevie Allen    actor         Murderer
NaN   2015       Darren Adamson    actor          Soldier
NaN   1948          Robert Alan    actor   Third Murderer
NaN   2016        John Albasiny    actor           Doctor
NaN   2014          Moyo Akand?  actress            Witch

In [5]:
cm.loc['Macbeth'].loc[4:18]     # n 값이 4~18 사이인 것만 출력

      year                 name     type        character
n
4.0   1916  Spottiswoode Aitken    actor           Duncan
6.0   1916           Mary Alden  actress     Lady Macduff
18.0  1948       William Alland    actor  Second Murderer

In [6]:
cm.loc['Macbeth'].iloc[4:18]    #4행부터 18행까지 선택. 8행까지 밖에 없으므로 8행까지 선택.

     year            name     type       character
n
NaN  2015  Darren Adamson    actor         Soldier
NaN  1948     Robert Alan    actor  Third Murderer
NaN  2016   John Albasiny    actor          Doctor
NaN  2014     Moyo Akand?  actress           Witch

In [7]:
cm = cm.reset_index('n')    # index에서 'n' 을 제거

In [9]:
cm.head()

,n,year,name,type,character
title,,,,,
#1 Serial Killer,17.0,2013,Michael Alton,actor,Detective Roberts
#DigitalLivesMatter,NaN,2016,Rashan Ali,actress,News Reporter
#FromJennifer,NaN,2017,Aaron Abrams,actor,Ralph Sinclair
#FromJennifer,NaN,2017,Christian Ackerman,actor,Simon
#Horror,1.0,2015,Emma Adler,actress,Georgie

## daegu_temp_20years.csv 파일을 수정하지 않고, read_csv()로 읽어서,

1. 최고온도, 최저온도 정보를 구해보고

2. 최고온도 top10, 최저 top 10 을 구해보세요

In [39]:
temp20 = pd.read_csv('daegu_temp_20years.csv', encoding = 'CP949', index_col=0)  ## encoding = 'CP949'를 추가하여 인코딩 에러 해결

In [40]:
temp20

                       Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
기온분석
[검색조건]                        NaN        NaN        NaN        NaN
자료구분 : 일                      NaN        NaN        NaN        NaN
자료형태 : 기본                     NaN        NaN        NaN        NaN
지역/지점 : 대구                    NaN        NaN        NaN        NaN
기간 : 20000621~20200720        NaN        NaN        NaN        NaN
...                           ...        ...        ...        ...
2020-07-16                    143       22.2       16.8       28.8
2020-07-17                    143       22.7       17.3       28.8
2020-07-18                    143       22.4       16.8       27.6
2020-07-19                    143       24.3       20.5         28
2020-07-20                    143       29.1       25.9       32.8

[7342 rows x 4 columns]

In [25]:
temp20.set_index(['기온분석'])

                       Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
기온분석
[검색조건]                        NaN        NaN        NaN        NaN
자료구분 : 일                      NaN        NaN        NaN        NaN
자료형태 : 기본                     NaN        NaN        NaN        NaN
지역/지점 : 대구                    NaN        NaN        NaN        NaN
기간 : 20000621~20200720        NaN        NaN        NaN        NaN
...                           ...        ...        ...        ...
2020-07-16                    143       22.2       16.8       28.8
2020-07-17                    143       22.7       17.3       28.8
2020-07-18                    143       22.4       16.8       27.6
2020-07-19                    143       24.3       20.5         28
2020-07-20                    143       29.1       25.9       32.8

[7342 rows x 4 columns]

In [27]:
temp20_2 = pd.DataFrame(temp20, columns = ['지점', '평균기온', '최저기온', '최고기온'])

In [28]:
temp20_2

      지점  평균기온  최저기온  최고기온
0    NaN   NaN   NaN   NaN
1    NaN   NaN   NaN   NaN
2    NaN   NaN   NaN   NaN
3    NaN   NaN   NaN   NaN
4    NaN   NaN   NaN   NaN
...   ..   ...   ...   ...
7337 NaN   NaN   NaN   NaN
7338 NaN   NaN   NaN   NaN
7339 NaN   NaN   NaN   NaN
7340 NaN   NaN   NaN   NaN
7341 NaN   NaN   NaN   NaN

[7342 rows x 4 columns]

## 풀이

In [49]:
# windows에서 쓰는 파일 중, 한글을 포함하는 파일이 utf-8 형식이 아닌 경우가 많음. 
# ms949 가 Windows에서 사용하는 한글 인코딩 방법.

df_tempdata = pd.read_csv('daegu_temp_20years.csv', encoding = 'ms949', skiprows=7)

In [50]:
len(df_tempdata)

7335

In [46]:
df_tempdata.shape

(7335, 5)

In [51]:
df_tempdata.head()

           날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0  2000-06-21  143     26.9     23.2     33.0
1  2000-06-22  143     21.5     20.3     23.4
2  2000-06-23  143     24.0     20.7     28.3
3  2000-06-24  143     21.2     20.1     22.4
4  2000-06-25  143     23.4     20.2     26.9

In [52]:
df_tempdata.set_index('날짜')

             지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
날짜
2000-06-21  143     26.9     23.2     33.0
2000-06-22  143     21.5     20.3     23.4
2000-06-23  143     24.0     20.7     28.3
2000-06-24  143     21.2     20.1     22.4
2000-06-25  143     23.4     20.2     26.9
...         ...      ...      ...      ...
2020-07-16  143     22.2     16.8     28.8
2020-07-17  143     22.7     17.3     28.8
2020-07-18  143     22.4     16.8     27.6
2020-07-19  143     24.3     20.5     28.0
2020-07-20  143     29.1     25.9     32.8

[7335 rows x 4 columns]

In [54]:
df_tempdata.tail()

              날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
7330  2020-07-16  143     22.2     16.8     28.8
7331  2020-07-17  143     22.7     17.3     28.8
7332  2020-07-18  143     22.4     16.8     27.6
7333  2020-07-19  143     24.3     20.5     28.0
7334  2020-07-20  143     29.1     25.9     32.8

In [55]:
df_tempdata['최고기온(℃)']

0       33.0
1       23.4
2       28.3
3       22.4
4       26.9
        ...
7330    28.8
7331    28.8
7332    27.6
7333    28.0
7334    32.8
Name: 최고기온(℃), Length: 7335, dtype: float64

In [56]:
df_tempdata['최고기온(℃)'].max()    # 최고기온 구하기

39.2

In [60]:
df_tempdata['최저기온(℃)'].min()    # 최저기온 구하기

-13.9

In [66]:
df_tempdata['최고기온(℃)'].idxmax()  # 최고기온을 갖는 index 출력

6610

In [65]:
df_tempdata.iloc[6610]      # 6610의 인덱스의 정보를 시리즈로 출력

날짜         2018-07-27
지점                143
평균기온(℃)          32.4
최저기온(℃)          28.6
최고기온(℃)          39.2
Name: 6610, dtype: object

In [67]:
df_tempdata.iloc[df_tempdata['최고기온(℃)'].idxmin()]

날짜         2016-01-24
지점                143
평균기온(℃)         -10.2
최저기온(℃)           -13
최고기온(℃)          -7.6
Name: 5695, dtype: object

In [70]:
df_tempdata.sort_values('최고기온(℃)', ascending = False).head(10)      # 내림차순으로 정렬 후 상위 10개만 출력하기

              날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
6610  2018-07-27  143     32.4     28.6     39.2
6618  2018-08-04  143     32.3     27.2     38.7
6607  2018-07-24  143     32.2     26.7     38.6
6603  2018-07-20  143     31.5     25.4     38.5
6240  2017-07-22  143     28.8     22.7     38.4
5524  2015-08-06  143     31.3     25.6     38.3
5897  2016-08-13  143     32.4     26.1     38.1
6606  2018-07-23  143     32.2     27.4     38.0
6609  2018-07-26  143     33.1     27.9     38.0
4800  2013-08-12  143     32.5     27.6     37.9

In [71]:
df_tempdata.sort_values('최저기온(℃)', ascending = True).head(10)       # 최저기온을 기준으로 오름차순으로 정렬 후 상위 10개 출력

              날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
6429  2018-01-27  143     -5.6    -13.9      2.8
3861  2011-01-16  143     -8.5    -13.1     -3.2
5695  2016-01-24  143    -10.2    -13.0     -7.6
6428  2018-01-26  143     -8.9    -13.0     -3.9
4615  2013-02-08  143     -6.5    -12.5     -0.5
4243  2012-02-02  143     -8.7    -12.4     -4.6
6427  2018-01-25  143     -8.7    -12.4     -4.4
3860  2011-01-15  143     -5.9    -12.3      0.1
6426  2018-01-24  143     -9.4    -12.3     -6.1
1310  2004-01-22  143     -8.1    -11.8     -3.7

In [79]:
df_tempdata.loc['2020-07-16']

지점         143.0
평균기온(℃)     22.2
최저기온(℃)     16.8
최고기온(℃)     28.8
Name: 2020-07-16, dtype: float64

In [81]:
df_tempdata.loc['2013-09-30']

지점         143.0
평균기온(℃)      NaN
최저기온(℃)     20.1
최고기온(℃)      NaN
Name: 2013-09-30, dtype: float64

## Hierarchical Indexing

In [82]:
data = pd.Series([10, 20, 30, 50, 5, 1, 2, 4])

In [83]:
data

0    10
1    20
2    30
3    50
4     5
5     1
6     2
7     4
dtype: int64

In [84]:
data = pd.Series([10, 20, 30, 50, 5, 1, 2, 4], 
                 index = [ ['a','a','a','a', 'b','b','b','b'],
                           ['obj1','obj2','obj3','obj4', 'obj1','obj2','obj3','obj4'] ])

In [85]:
data        # a, b가 첫번째 인덱스, obj가 두번째 인덱스

a  obj1    10
   obj2    20
   obj3    30
   obj4    50
b  obj1     5
   obj2     1
   obj3     2
   obj4     4
dtype: int64

In [86]:
data.index

MultiIndex([('a', 'obj1'),
            ('a', 'obj2'),
            ('a', 'obj3'),
            ('a', 'obj4'),
            ('b', 'obj1'),
            ('b', 'obj2'),
            ('b', 'obj3'),
            ('b', 'obj4')],
           )

In [88]:
data.index.levels   # 0번 인덱스에는 'a', 'b' (level = 0), 1번 인덱스에는 obj1 ~ obj4 (level = 1)

FrozenList([['a', 'b'], ['obj1', 'obj2', 'obj3', 'obj4']])

In [89]:
data.index.get_level_values(-1)

Index(['obj1', 'obj2', 'obj3', 'obj4', 'obj1', 'obj2', 'obj3', 'obj4'], dtype='object')

In [90]:
data.index.get_level_values(1)

Index(['obj1', 'obj2', 'obj3', 'obj4', 'obj1', 'obj2', 'obj3', 'obj4'], dtype='object')

In [91]:
data.index.get_level_values(0)

Index(['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'], dtype='object')

In [92]:
data

a  obj1    10
   obj2    20
   obj3    30
   obj4    50
b  obj1     5
   obj2     1
   obj3     2
   obj4     4
dtype: int64

In [93]:
# data에서 선택할때 --> 인덱스 값을 사용
data['a']

obj1    10
obj2    20
obj3    30
obj4    50
dtype: int64

In [94]:
# a 의 obj1을 선택하고 싶을때
data['a','obj1']

10

In [95]:
data[:, 'obj2']

a    20
b     1
dtype: int64

## Unstack

 - row header(row index) --> column geader(column index) 로 변경

 - Series --> DataFrame으로 변경!!!

In [96]:
data

a  obj1    10
   obj2    20
   obj3    30
   obj4    50
b  obj1     5
   obj2     1
   obj3     2
   obj4     4
dtype: int64

In [97]:
type(data)

pandas.core.series.Series

In [98]:
data_u = data.unstack() # level = -1 이 기본값. -1이 의미하는 것은 맨 마지막 level

In [99]:
data_u

   obj1  obj2  obj3  obj4
a    10    20    30    50
b     5     1     2     4

In [100]:
type(data_u)

pandas.core.frame.DataFrame

In [101]:
data_u2 = data.unstack(level=0)

In [102]:
data_u2

       a  b
obj1  10  5
obj2  20  1
obj3  30  2
obj4  50  4

### Column index ---> Row index!

In [103]:
data_u2

       a  b
obj1  10  5
obj2  20  1
obj3  30  2
obj4  50  4

In [106]:
data_u2.stack()     # 'a'와 'b' 가 row index로 사용

obj1  a    10
      b     5
obj2  a    20
      b     1
obj3  a    30
      b     2
obj4  a    50
      b     4
dtype: int64

In [109]:
data_u

   obj1  obj2  obj3  obj4
a    10    20    30    50
b     5     1     2     4

In [110]:
data_u.stack()

a  obj1    10
   obj2    20
   obj3    30
   obj4    50
b  obj1     5
   obj2     1
   obj3     2
   obj4     4
dtype: int64

### Multiple Column Index

In [111]:
df = pd.DataFrame(np.arange(12).reshape(4,3))

In [112]:
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [113]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                  index = [ ['a','a','b','b'], ['one','two','three','four'] ],
                  columns= [ ['num1', 'num2', 'num3'], ['red', 'greeb', 'red'] ]
                  )

In [114]:
df

        num1  num2 num3
         red greeb  red
a one      0     1    2
  two      3     4    5
b three    6     7    8
  four     9    10   11

In [115]:
df.columns

MultiIndex([('num1',   'red'),
            ('num2', 'greeb'),
            ('num3',   'red')],
           )

In [116]:
df.index.levels

FrozenList([['a', 'b'], ['four', 'one', 'three', 'two']])

In [117]:
df.columns.levels

FrozenList([['num1', 'num2', 'num3'], ['greeb', 'red']])

In [118]:
# 각 index에 이름을 달아보자

df.index.names = ['key1', 'key2']

In [119]:
df

           num1  num2 num3
            red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [120]:
df.columns.names=['n', 'color']

In [121]:
df

n          num1  num2 num3
color       red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [122]:
df.loc['a']

n     num1  num2 num3
color  red greeb  red
key2
one      0     1    2
two      3     4    5

In [123]:
df.loc['a'].loc['two']  # loc['a']로 만들어진 것중에 loc['two']

n     color
num1  red      3
num2  greeb    4
num3  red      5
Name: two, dtype: int32

In [124]:
df

n          num1  num2 num3
color       red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [125]:
df['num1']

color       red
key1 key2
a    one      0
     two      3
b    three    6
     four     9

In [128]:
df.loc[:, 'num1']   # 전체 행 중에 num1 열을 선택

color       red
key1 key2
a    one      0
     two      3
b    three    6
     four     9

In [129]:
df.iloc[0]      # index가 0인 데이터를 시리즈로 출력. 제일 첫번째 가로 행이 index = 0

n     color
num1  red      0
num2  greeb    1
num3  red      2
Name: (a, one), dtype: int32

## index level을 변경하자!!

In [130]:
df.swaplevel()      # default 값 사용하면 -2와 -1 위치를 바꾸어줌. 지금 경우에는 두 개 밖에 없으니까 두 개를 서로 바꿔줌.

n          num1  num2 num3
color       red greeb  red
key2  key1
one   a       0     1    2
two   a       3     4    5
three b       6     7    8
four  b       9    10   11

In [132]:
df.swaplevel('key1', 'key2',axis=0)

n          num1  num2 num3
color       red greeb  red
key2  key1
one   a       0     1    2
two   a       3     4    5
three b       6     7    8
four  b       9    10   11

In [133]:
df.swaplevel('n', 'color', axis=1)

color       red greeb  red
n          num1  num2 num3
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [134]:
df

n          num1  num2 num3
color       red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [135]:
# 기준값을 설정
df.sort_index(level = 'key2')

n          num1  num2 num3
color       red greeb  red
key1 key2
b    four     9    10   11
a    one      0     1    2
b    three    6     7    8
a    two      3     4    5

In [136]:
df.sort_index()

n          num1  num2 num3
color       red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    four     9    10   11
     three    6     7    8

In [137]:
df.sum()

n     color
num1  red      18
num2  greeb    22
num3  red      26
dtype: int64

In [138]:
df.sum(level = 'key1')  # key1을 기준으로 묶어서 합을 구함.

n     num1  num2 num3
color  red greeb  red
key1
a        3     5    7
b       15    17   19

In [140]:
df.sum(level = 'color', axis = 1)  # color를 기준으로 같은 color를 갖는 항목들의 합을 구함

color       red  greeb
key1 key2
a    one      2      1
     two      8      4
b    three   14      7
     four    20     10

In [143]:
df

n          num1  num2 num3
color       red greeb  red
key1 key2
a    one      0     1    2
     two      3     4    5
b    three    6     7    8
     four     9    10   11

In [141]:
df.mean()

n     color
num1  red      4.5
num2  greeb    5.5
num3  red      6.5
dtype: float64

In [142]:
df.mean(level='color', axis=1)

color       red  greeb
key1 key2
a    one      1      1
     two      4      4
b    three    7      7
     four    10     10